// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.



// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = +prompt('Введіть номер квартири від 1 до 90');
// if (flat > 0 && flat <= 20) {
//     console.log('Перший підїзд');
// } else if (flat >= 21 && flat <= 48) {
//     console.log('Другий підїзд');
// } else if (flat >= 49 && flat <= 90) {
//     console.log('Третій підїзд');
// }


// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО


// let number = +prompt('Введіть число');
// if (number === 10) {
//     console.log('Вірно ');
// } else  {
//     console.log ('Невірно');
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

//

// let x = 125;
// if (typeof x === 'number') {
//     console.log('ви ввели число')
// } else if (typeof x === "string") {
//     console.log('Ви ввели текст')
// } else if (typeof x === "object") {
//     console.log('Ви ввели обєкт')
// } else if (typeof x === "boolean") {
//     console.log('Ви ввели булеве значення')
// } else {
//     console.log('Ви ввели незрозумілі символи')
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
//
// let t = +prompt('Яка температура повітря?')
// if (t >= 10 && t <= 22) {
//     console.log('Так, сьогодні є навчання');
// } else {
//     console.log('Залишайтесь вдома сьогодні навчання online');
// }

//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .


// є кілька незрозумілих речей в завданні але я думаю тут головне сама побудова тому так

        // let game = +prompt('Введіть число')
        // switch (game) {
        //     case 1:
        //         console.log('Ви виграли авто');
        //         break;
        //     case 2:
        //         console.log('Ви виграли мото');
        //         break;
        //     case 3:
        //         console.log('Ви виграли телефон');
        //         break;
        //     case 4:
        //         console.log('Ви виграли велосипед');
        //         break;
        //     case 5:
        //         console.log('Ви виграли планшет');
        //         break;
        //     default:
        //         console.log('Число невірне');
        // }
