// 1. Створити пустий масив та :

// a. заповнити його 50 парними числами за допомоги циклу.
// let arr = [];
// for (let i = 2; i <= 100; i= i+2) {
//     arr[i] = i;
// }
//
// console.log(arr);
//

// b. заповнити його 50 непарними числами за допомоги циклу.
// let arr = [];
// for (let i = 1; i < 100; i += 2) {
//     arr[i] = i;
// }
//
// console.log(arr);


//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)

// let arr3 = [];
//
// for (let i = 1; i<20; i++ ) {
//     arr3[i] = Math.floor(Math.random() * 1000);
// }
// console.log(arr3)


// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

// let arr3 = [];
//
// for (let i = 0; i<10; i++ ) {
//     arr3[i] = (Math.floor(Math.random() * 732)+8);
// }
// console.log(arr3)


// 2. Вивести за допомогою console.log кожен третій елемен





// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// let arr = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ]
// for (let number of arr) {
//     if(arr[number] % 2===0) {
//         console.log(arr)
//
//     }
// }

// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
// let array = [4,3,4,5];
// for (const el of array) {
//     let sum = 0;
//     for (let el of array) {
//         sum = sum + el/ array.length;
//     }
//     console.log(sum);
// }


// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let array = [1,2,3]
//
//     let sum = 0;
//     for(let el of array) {
//         sum = el * 5;
//     }
//     console.log(sum)

// massiv = [1, 2];
// let mathe = [];
// for (u = 0; u < massiv.length; u++){
//     mathe.push(massiv[u] *5);
// };
// console.log(mathe);
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
